Por lo tanto, en este ejercicio nos queda por limpiar algunas columnas del conjunto de datos, as√≠ que manos a la obra. Vamos a ver que podemos hacer para cada una de las columnas y os dejaremos algunas pistas üòâ. Para esto trabajaremos con el fichero generado en Limpieza I.

In [5]:
import pandas as pd
import seaborn as sns
import numpy as np
import matplotlib.pyplot as plt

In [6]:
pd.options.display.max_columns = None

In [7]:
df_bancario = pd.read_csv("../datos/bank-additional-full2.csv", index_col = 0)
df_bancario.head(5)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
0,56,housemaid,married,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"['may', 'mon']"
1,57,services,married,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"['may', 'mon']"
2,37,services,married,high.school,0.0,1.0,0.0,telephone,226,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"['may', 'mon']"
3,40,admin.,married,basic.6y,0.0,0.0,0.0,telephone,151,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"['may', 'mon']"
4,56,services,married,high.school,0.0,0.0,1.0,telephone,307,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"['may', 'mon']"

1. Columnas loan, housing y default: estas columnas contienen valores √∫nicos de 0 y 1. Esto puede parecer poco intuitivo a la hora de la extracci√≥n de conclusiones y en las visualizaciones. El objetivo de este ejercicio es que cambies los valores n√∫mericos por "Si" y "No". A que corresponde cada uno de los valores lo ten√©is en el pair de Limpieza I.

In [8]:
mapa = {0.0: 'No', 1.0: 'Si'}

In [9]:
for col in df_bancario.columns[4:7]:
    df_bancario[col] = df_bancario[col].map(mapa, na_action="ignore")

df_bancario.head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
0,56,housemaid,married,basic.4y,No,No,No,telephone,261,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"['may', 'mon']"
1,57,services,married,high.school,NaN,No,No,telephone,149,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"['may', 'mon']"
2,37,services,married,high.school,No,Si,No,telephone,226,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"['may', 'mon']"
3,40,admin.,married,basic.6y,No,No,No,telephone,151,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"['may', 'mon']"
4,56,services,married,high.school,No,No,Si,telephone,307,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"['may', 'mon']"

2. Para la columna de education, si nos fijamos en sus valores √∫nicos veremos que tenemos puntos. El objetivo de este ejercicio es que quit√©is los puntos de esos valores y los reemplac√©is por espacios.

In [10]:
df_bancario['education'] = df_bancario['education'].str.replace('.',' ')
df_bancario.head()

/tmp/ipykernel_15091/2193172620.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df_bancario['education'] = df_bancario['education'].str.replace('.',' ')

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
0,56,housemaid,married,basic 4y,No,No,No,telephone,261,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"['may', 'mon']"
1,57,services,married,high school,NaN,No,No,telephone,149,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"['may', 'mon']"
2,37,services,married,high school,No,Si,No,telephone,226,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"['may', 'mon']"
3,40,admin.,married,basic 6y,No,No,No,telephone,151,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"['may', 'mon']"
4,56,services,married,high school,No,No,Si,telephone,307,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"['may', 'mon']"

3. Para la columna job, hay un valor √∫nico que esta abreviado (admin.), cambiad la abreviatura por el nombre completo.

In [11]:
df_bancario['job'] = df_bancario['job'].str.replace('admin.','administrator')
df_bancario.sample(5)

/tmp/ipykernel_15091/584409843.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df_bancario['job'] = df_bancario['job'].str.replace('admin.','administrator')

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
23225,44,technician,married,professional course,No,No,No,cellular,168,6,999,0,NONEXISTENT,1.4,93.444,-36.1,4.965,"5228,1",no,"['aug', 'tue']"
17420,57,self-employed,married,university degree,NaN,Si,No,telephone,40,1,999,0,NONEXISTENT,1.4,93.918,-42.7,4.962,"5228,1",no,"['jul', 'mon']"
9722,42,blue-collar,single,basic 9y,No,No,No,telephone,306,5,999,0,NONEXISTENT,1.4,94.465,-41.8,4.961,"5228,1",no,"['jun', 'mon']"
27600,48,unemployed,divorced,professional course,No,Si,No,telephone,122,4,999,0,NONEXISTENT,-0.1,93.200,-42.0,4.021,"5195,8",no,"['nov', 'fri']"
2591,58,entrepreneur,married,university degree,NaN,No,No,telephone,437,2,999,0,NONEXISTENT,1.1,93.994,-36.4,4.856,"5191,0",no,"['may', 'tue']"

In [12]:
df_bancario['job'].unique()

# comprobamos que nos ha cambiado correctamente la palabra

array(['housemaid', 'services', 'administrator', 'blue-collar',
       'technician', 'retired', 'management', 'unemployed',
       'self-employed', nan, 'entrepreneur', 'student'], dtype=object)

4. La columna month_day_week tiene una lista que contiene informaci√≥n muy diferente. El objetivo de este ejercicio es separar esta columna en dos nuevas, donde tengamos los meses en una columna y los d√≠as de la semana en otra.

In [13]:
eliminar_corchetes = lambda x: x.strip('[]')

In [14]:
df_bancario['month_day_week'] = df_bancario['month_day_week'].apply(eliminar_corchetes)

In [15]:
df_bancario[['month','day_week']] = df_bancario['month_day_week'].str.split(',', expand=True)
df_bancario.head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week,month,day_week
0,56,housemaid,married,basic 4y,No,No,No,telephone,261,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"'may', 'mon'",'may','mon'
1,57,services,married,high school,NaN,No,No,telephone,149,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"'may', 'mon'",'may','mon'
2,37,services,married,high school,No,Si,No,telephone,226,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"'may', 'mon'",'may','mon'
3,40,administrator,married,basic 6y,No,No,No,telephone,151,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"'may', 'mon'",'may','mon'
4,56,services,married,high school,No,No,Si,telephone,307,1,999,0,NONEXISTENT,1.1,93.994,-36.4,4.857,"5191,0",no,"'may', 'mon'",'may','mon'

5. Guarda el csv con las columnas limpias para seguir trabajando con este dataframe limpio.

In [17]:
df_bancario.to_csv("../datos/bank-additional-full3.csv")